RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmra.c
/**
 *******************************************************************************
 * @file  hc32f4a0_tmra.c
 * @brief This file provides firmware functions to manage the TMRA(TimerA).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wuze            First version
   2020-07-02       Wuze            API TMRA_SyncStartCmd() refine.
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_tmra.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_TMRA TMRA
 * @brief TMRA Driver Library
 * @{
 */

#if (DDL_TMRA_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMRA_Local_Macros TMRA Local Macros
 * @{
 */

/**
 * @defgroup TMRA_Configuration_Bit_Mask TMRA Configuration Bit Mask
 * @{
 */
#define TMRA_BCSTR_INIT_MSK                     (0x01F6UL)
#define TMRA_BCSTR_INT_MSK                      (0x00003000UL)
#define TMRA_BCSTR_FLAG_MSK                     (0x0000C000UL)
#define TMRA_FCONR_FILTER_CLK_MSK               (0x3UL)
#define TMRA_CCONR_FILTER_CLK_MSK               (TMRA_CCONR_NOFICKCP)
#define TMRA_PWM_POLARITY_MSK                   (0x03FFUL)
#define TMRA_TRIG_COND_MSK                      (TMRA_START_COND_ALL | TMRA_STOP_COND_ALL | TMRA_CLR_COND_ALL)
#define TMRA_CACHE_COND_MSK                     (TMRA_BCONR_BSE0 | TMRA_BCONR_BSE1)
#define TMRA_COM_TRIG_MSK                       (TMRA_COM_TRIG1 | TMRA_COM_TRIG2)
#define TMRA_TRIG_EVENT_MSK                     (AOS_TMRA_HTSSR_TRGSEL)
/**
 * @}
 */

/**
 * @defgroup TMRA_Unit_Index TMRA Unit Index
 * @{
 */
#define __TMRA_BASE                             (0x4003A000UL)
#define __TMRA_UNIT_SIZE                        (0x400UL)
#define TMRA_IDX(__TMRAx__)                     (((uint32_t)&(__TMRAx__)->CNTER - __TMRA_BASE) / __TMRA_UNIT_SIZE)
/**
 * @}
 */

/**
 * @defgroup TMRA_Register_Bit_Band TMRA Register Bit Band
 * @{
 */
#define __BIT_BAND_BASE                         (0x42000000UL)
#define __PERIP_BASE                            (0x40000000UL)
#define __REG_OFS(regAddr)                      ((regAddr) - __PERIP_BASE)
#define __BIT_BAND_ADDR(regAddr, pos)           ((__REG_OFS(regAddr) << 5U) + ((uint32_t)(pos) << 2U) + __BIT_BAND_BASE)
#define BIT_BAND(regAddr, pos)                  (*(__IO uint32_t *)__BIT_BAND_ADDR((regAddr), (pos)))
/**
 * @}
 */

/**
 * @defgroup TMRA_HTSSR_Address TMRA HTSSR Address
 * @{
 */
#define TMRA_HTSSR0_ADDR                        (0x40010880UL)
#define TMRA_HTSSR1_ADDR                        (0x40010884UL)
#define TMRA_HTSSR2_ADDR                        (0x40010888UL)
#define TMRA_HTSSR3_ADDR                        (0x4001088CUL)
/**
 * @}
 */

/**
 * @defgroup TMRA_Check_Parameters_Validity TMRA check parameters validity
 * @{
 */
#define IS_TMRA_UNIT(x)                                                        \
(   ((x) == M4_TMRA_1)                      ||                                 \
    ((x) == M4_TMRA_2)                      ||                                 \
    ((x) == M4_TMRA_3)                      ||                                 \
    ((x) == M4_TMRA_4)                      ||                                 \
    ((x) == M4_TMRA_5)                      ||                                 \
    ((x) == M4_TMRA_6)                      ||                                 \
    ((x) == M4_TMRA_7)                      ||                                 \
    ((x) == M4_TMRA_8)                      ||                                 \
    ((x) == M4_TMRA_9)                      ||                                 \
    ((x) == M4_TMRA_10)                     ||                                 \
    ((x) == M4_TMRA_11)                     ||                                 \
    ((x) == M4_TMRA_12))

#define IS_TMRA_EVEN_UNIT(x)                                                   \
(   ((x) == M4_TMRA_2)                      ||                                 \
    ((x) == M4_TMRA_4)                      ||                                 \
    ((x) == M4_TMRA_6)                      ||                                 \
    ((x) == M4_TMRA_8)                      ||                                 \
    ((x) == M4_TMRA_10)                     ||                                 \
    ((x) == M4_TMRA_12))

#define IS_TMRA_CH(x)                                                          \
(   ((x) <= TMRA_CH_4))

#define IS_TMRA_FUNC_MODE(x)                                                   \
(   ((x) == TMRA_FUNC_COMPARE)              ||                                 \
    ((x) == TMRA_FUNC_CAPTURE))

#define IS_TMRA_PCLK_DIV(x)                                                    \
(   ((x) == TMRA_PCLK_DIV1)                 ||                                 \
    ((x) == TMRA_PCLK_DIV2)                 ||                                 \
    ((x) == TMRA_PCLK_DIV4)                 ||                                 \
    ((x) == TMRA_PCLK_DIV8)                 ||                                 \
    ((x) == TMRA_PCLK_DIV16)                ||                                 \
    ((x) == TMRA_PCLK_DIV32)                ||                                 \
    ((x) == TMRA_PCLK_DIV64)                ||                                 \
    ((x) == TMRA_PCLK_DIV128)               ||                                 \
    ((x) == TMRA_PCLK_DIV256)               ||                                 \
    ((x) == TMRA_PCLK_DIV512)               ||                                 \
    ((x) == TMRA_PCLK_DIV1024))

