RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmra.c
#define IS_TMRA_CNT_DIR(x)                                                     \
(   ((x) == TMRA_DIR_DOWN)                  ||                                 \
    ((x) == TMRA_DIR_UP))

#define IS_TMRA_CNT_MODE(x)                                                    \
(   ((x) == TMRA_MODE_SAWTOOTH)             ||                                 \
    ((x) == TMRA_MODE_TRIANGLE))

#define IS_TMRA_OVF_OPERATION(x)                                               \
(   ((x) == TMRA_OVF_CNT_CONTINUE)          ||                                 \
    ((x) == TMRA_OVF_CNT_STOP))

#define IS_TMRA_FILTER_CLK_DIV(x)                                              \
(   ((x) <= TMRA_FILTER_CLK_DIV64))

#define IS_TMRA_CACHE_COND(x)                                                  \
(   ((x) == TMRA_CACHE_COND_OVF_CLR)        ||                                 \
    ((x) == TMRA_CACHE_COND_TW_VALLEY)      ||                                 \
    ((x) == TMRA_CACHE_COND_TW_PEAK))

#define IS_TMRA_PWM_START_POLARITY(x)                                          \
(   ((x) == TMRA_PWM_START_LOW)             ||                                 \
    ((x) == TMRA_PWM_START_HIGH)            ||                                 \
    ((x) == TMRA_PWM_START_KEEP))

#define IS_TMRA_PWM_STOP_POLARITY(x)                                           \
(   ((x) == TMRA_PWM_STOP_LOW)              ||                                 \
    ((x) == TMRA_PWM_STOP_HIGH)             ||                                 \
    ((x) == TMRA_PWM_STOP_KEEP))

#define IS_TMRA_PWM_CMP_POLARITY(x)                                            \
(   ((x) == TMRA_PWM_CMP_LOW)               ||                                 \
    ((x) == TMRA_PWM_CMP_HIGH)              ||                                 \
    ((x) == TMRA_PWM_CMP_KEEP)              ||                                 \
    ((x) == TMRA_PWM_CMP_REVERSE))

#define IS_TMRA_PWM_PERIOD_POLARITY(x)                                         \
(   ((x) == TMRA_PWM_PERIOD_LOW)            ||                                 \
    ((x) == TMRA_PWM_PERIOD_HIGH)           ||                                 \
    ((x) == TMRA_PWM_PERIOD_KEEP)           ||                                 \
    ((x) == TMRA_PWM_PERIOD_REVERSE))

#define IS_TMRA_PWM_FORCE_POLARITY(x)                                          \
(   ((x) == TMRA_PWM_FORCE_INVALID)         ||                                 \
    ((x) == TMRA_PWM_FORCE_LOW)             ||                                 \
    ((x) == TMRA_PWM_FORCE_HIGH))

#define IS_TMRA_EVT_USAGE(x)                                                   \
(   ((x) == TMRA_EVENT_USAGE_CNT)           ||                                 \
    ((x) == TMRA_EVENT_USAGE_CAPT))

#define IS_TMRA_COM_TRIGGER(x)                                                 \
(   ((x) != 0U)                             &&                                 \
    (((x) | TMRA_COM_TRIG_MSK) == TMRA_COM_TRIG_MSK))

#define IS_TMRA_VALID_VAL(x)                                                   \
(   (x) <= 0xFFFFUL)

/**
 * @}
 */

/**
 * @defgroup TMRA_Miscellaneous_Macros TMRA Miscellaneous Macros
 * @{
 */
#define TMRA_CH_COUNT                       (4U)
#define TMRA_PIN_PWM_OFFSET                 (3U)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup TMRA_Global_Functions TMRA Global Functions
 * @{
 */

/**
 * @brief  Initializes the specified TMRA peripheral according to the specified parameters \
 *         in the structure stc_tmra_init_t
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  pstcInit               Pointer to a stc_tmra_init_t structure value that \
 *                                      contains the configuration information for the TMRA.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcInit == NULL.
 */
en_result_t TMRA_Init(M4_TMRA_TypeDef *TMRAx, const stc_tmra_init_t *pstcInit)
{
    uint32_t u32Cfg = 0U;
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
        DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
        DDL_ASSERT(IS_TMRA_CNT_DIR(pstcInit->u32CntDir));
        DDL_ASSERT(IS_TMRA_CNT_MODE(pstcInit->u32CntMode));
        DDL_ASSERT(IS_TMRA_OVF_OPERATION(pstcInit->u32CntOvfOp));
        DDL_ASSERT(IS_TMRA_VALID_VAL(pstcInit->u32PeriodVal));
        DDL_ASSERT(IS_TMRA_VALID_VAL(pstcInit->u32CntVal));

        if (pstcInit->u32ClkSrc == TMRA_CLK_PCLK)
        {
            DDL_ASSERT(IS_TMRA_PCLK_DIV(pstcInit->u32PCLKDiv));
            u32Cfg = pstcInit->u32PCLKDiv | pstcInit->u32CntDir | pstcInit->u32CntMode;
        }
        else
        {
            WRITE_REG32(TMRAx->HCUPR, (pstcInit->u32ClkSrc & TMRA_CLK_HW_UP_ALL));
            WRITE_REG32(TMRAx->HCDOR, ((pstcInit->u32ClkSrc & TMRA_CLK_HW_DOWN_ALL) >> 16U));
        }

        u32Cfg |= pstcInit->u32CntOvfOp;

        MODIFY_REG32(TMRAx->BCSTR, TMRA_BCSTR_INIT_MSK, u32Cfg);
        WRITE_REG32(TMRAx->PERAR, pstcInit->u32PeriodVal);
        WRITE_REG32(TMRAx->CNTER, pstcInit->u32CntVal);

