RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmra.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set a default value for the TMRA initialization structure.
 * @param  [in]  pstcInit               Pointer to a stc_tmra_init_t structure value that \
 *                                      contains the configuration information for the TMRA.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcInit == NULL.
 */
en_result_t TMRA_StructInit(stc_tmra_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
        pstcInit->u32ClkSrc    = TMRA_CLK_PCLK;
        pstcInit->u32PCLKDiv   = TMRA_PCLK_DIV1;
        pstcInit->u32CntDir    = TMRA_DIR_UP;
        pstcInit->u32CntMode   = TMRA_MODE_SAWTOOTH;
        pstcInit->u32CntOvfOp  = TMRA_OVF_CNT_CONTINUE;
        pstcInit->u32PeriodVal = 0xFFFFUL;
        pstcInit->u32CntVal    = 0UL;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initializes the TMRA peripheral. Reset all registers of the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @retval None
 */
void TMRA_DeInit(M4_TMRA_TypeDef *TMRAx)
{
    uint32_t i;
    uint32_t u32AddrOffset;
    uint32_t u32CMPARAddr;
    uint32_t u32CCONRAddr;
    uint32_t u32PCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));

    u32CMPARAddr = TMRAx->CMPAR1;
    u32CCONRAddr = TMRAx->CCONR1;
    u32PCONRAddr = TMRAx->PCONR1;

    for (i=0U; i<TMRA_CH_COUNT; i++)
    {
        u32AddrOffset = i * 4U;
        RW_MEM32(u32CMPARAddr + u32AddrOffset) = 0xFFFFUL;
        RW_MEM32(u32CCONRAddr + u32AddrOffset) = 0x0UL;
        RW_MEM32(u32PCONRAddr + u32AddrOffset) = 0x0UL;
    }

    WRITE_REG32(TMRAx->CNTER, 0x0U);
    WRITE_REG32(TMRAx->PERAR, 0xFFFFU);
    WRITE_REG32(TMRAx->BCSTR, 0x2U);
    WRITE_REG32(TMRAx->ICONR, 0x0U);
    WRITE_REG32(TMRAx->ECONR, 0x0U);
    WRITE_REG32(TMRAx->FCONR, 0x0U);
    WRITE_REG32(TMRAx->STFLR, 0x0U);
    WRITE_REG32(TMRAx->BCONR1, 0x0U);
    WRITE_REG32(TMRAx->BCONR2, 0x0U);
    WRITE_REG32(TMRAx->HCONR, 0x0U);
    WRITE_REG32(TMRAx->HCUPR, 0x0U);
    WRITE_REG32(TMRAx->HCDOR, 0x0U);
}

/**
 * @brief  Set general count value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32Val                 The general count value to be set.
 *                                      This parameter can be a number between 0U and 0xFFFFU, inclusive.
 * @retval None
 */
void TMRA_SetCntVal(M4_TMRA_TypeDef *TMRAx, uint32_t u32Val)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_VALID_VAL(u32Val));
    WRITE_REG32(TMRAx->CNTER, u32Val);
}

/**
 * @brief  Get general count value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @retval An uint32_t type type value of general count value between 0U and 0xFFFFU, inclusive.
 */
uint32_t TMRA_GetCntVal(const M4_TMRA_TypeDef *TMRAx)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    return (TMRAx->CNTER);
}

/**
 * @brief  Set period reference value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32Val                 The period reference value to be set.
 *                                      This parameter can be a number between 0U and 0xFFFFU, inclusive.
 * @retval None
 */
void TMRA_SetPeriodVal(M4_TMRA_TypeDef *TMRAx, uint32_t u32Val)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_VALID_VAL(u32Val));
    WRITE_REG32(TMRAx->PERAR, u32Val);
}

/**
 * @brief  Get period reference value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @retval An uint32_t type type value of period reference value between 0U and 0xFFFFU, inclusive.
 */
uint32_t TMRA_GetPeriodVal(const M4_TMRA_TypeDef *TMRAx)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    return (TMRAx->PERAR);
}

/**
 * @brief  Specifies the function mode of the specified TMRA channle.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be a value of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_2:                   Channel 2 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 *   @arg  TMRA_CH_4:                   Channel 4 of TMRA.
 * @param  [in]  u32FuncMode            Function mode of TMRA.
 *                                      This parameter can be a value of @ref TMRA_Function_Mode
 *   @arg  TMRA_FUNC_COMPARE:           The function mode of TMRA is comparison ouput.
 *   @arg  TMRA_FUNC_CAPTURE:           The function mode of TMRA is capture the input.
 * @retval None
 */
void TMRA_SetFuncMode(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32FuncMode)
{
    uint32_t u32CCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CH(u8TmrCh));
    DDL_ASSERT(IS_TMRA_FUNC_MODE(u32FuncMode));

