RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmra.c
    u32PCONRAddr = (uint32_t)&TMRAx->PCONR1 + (uint32_t)u8TmrCh * 4U;
    BIT_BAND(u32PCONRAddr, TMRA_PCONR_OUTEN_POS) = (uint32_t)enNewState;
}

/**
 * @brief  Specifies the divider of filter's clock source for the specified TMRA input pin.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8InputPin             The input pin of TMRA.
 *                                      This parameter can be values of @ref TMRA_Input_Pin
 *   @arg  TMRA_PIN_TRIG:               Pin TIMA_<t>_TRIG.
 *   @arg  TMRA_PIN_CLKA:               Pin TIMA_<t>_CLKA.
 *   @arg  TMRA_PIN_CLKB:               Pin TIMA_<t>_CLKB.
 *   @arg  TMRA_PIN_PWM1:               Pin TIMA_<t>_PWM1.
 *   @arg  TMRA_PIN_PWM2:               Pin TIMA_<t>_PWM2.
 *   @arg  TMRA_PIN_PWM3:               Pin TIMA_<t>_PWM3.
 *   @arg  TMRA_PIN_PWM4:               Pin TIMA_<t>_PWM4.
 * @param  [in]  u32ClkDiv              The clock source divider of the filter.
 *                                      This parameter can be a value of @ref TMRA_Filter_Clock_Divider
 *   @arg  TMRA_FILTER_CLK_DIV1:        The filter clock is PCLK / 1.
 *   @arg  TMRA_FILTER_CLK_DIV4:        The filter clock is PCLK / 4.
 *   @arg  TMRA_FILTER_CLK_DIV16:       The filter clock is PCLK / 16.
 *   @arg  TMRA_FILTER_CLK_DIV64:       The filter clock is PCLK / 64.
 * @retval None
 */
void TMRA_FilterConfig(M4_TMRA_TypeDef *TMRAx, uint8_t u8InputPin, uint32_t u32ClkDiv)
{
    uint8_t u8PinIdx = 0U;
    uint8_t u8TmrCh;
    uint32_t u32CfgMsk;
    uint32_t u32CCONRAddr;
    uint8_t au8Offset[] = {TMRA_FCONR_NOFICKTG_POS, TMRA_FCONR_NOFICKCA_POS, TMRA_FCONR_NOFICKCB_POS, \
                           TMRA_CCONR_NOFICKCP_POS, TMRA_CCONR_NOFICKCP_POS, TMRA_CCONR_NOFICKCP_POS, \
                           TMRA_CCONR_NOFICKCP_POS};

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_FILTER_CLK_DIV(u32ClkDiv));

    u8InputPin &= (uint8_t)TMRA_PIN_ALL;
    while (u8InputPin != 0U)
    {
        if ((u8InputPin & 0x1U) != 0U)
        {
            if (u8PinIdx < TMRA_PIN_PWM_OFFSET)
            {
                u32CfgMsk = (uint32_t)(TMRA_FCONR_FILTER_CLK_MSK << au8Offset[u8PinIdx]);
                MODIFY_REG32(TMRAx->FCONR, u32CfgMsk, (u32ClkDiv << au8Offset[u8PinIdx]));
            }
            else
            {
                u8TmrCh = u8PinIdx - TMRA_PIN_PWM_OFFSET;
                u32CCONRAddr = (uint32_t)&TMRAx->CCONR1 + (uint32_t)u8TmrCh * 4U;
                MODIFY_REG32(RW_MEM32(u32CCONRAddr),    \
                             TMRA_CCONR_FILTER_CLK_MSK, \
                             (u32ClkDiv << au8Offset[u8PinIdx]));
            }
        }
        u8InputPin >>= 1U;
        u8PinIdx++;
    }
}

/**
 * @brief  Enable or disable the filter function of the specified TMRA input pin.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8InputPin             The input pin of TMRA.
 *                                      This parameter can be values of @ref TMRA_Input_Pin
 *   @arg  TMRA_PIN_TRIG:               Pin TIMA_<t>_TRIG.
 *   @arg  TMRA_PIN_CLKA:               Pin TIMA_<t>_CLKA.
 *   @arg  TMRA_PIN_CLKB:               Pin TIMA_<t>_CLKB.
 *   @arg  TMRA_PIN_PWM1:               Pin TIMA_<t>_PWM1.
 *   @arg  TMRA_PIN_PWM2:               Pin TIMA_<t>_PWM2.
 *   @arg  TMRA_PIN_PWM3:               Pin TIMA_<t>_PWM3.
 *   @arg  TMRA_PIN_PWM4:               Pin TIMA_<t>_PWM4.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable the specified pin's filter.
 *   @arg  Disable:                     Disable the specified pin's filter.
 * @retval None
 */
void TMRA_FilterCmd(M4_TMRA_TypeDef *TMRAx, uint8_t u8InputPin, en_functional_state_t enNewState)
{
    uint8_t u8PinIdx = 0U;
    uint8_t u8TmrCh;
    uint32_t u32CCONRAddr;
    uint8_t au8Offset[] = {TMRA_FCONR_NOFIENTG_POS, TMRA_FCONR_NOFIENCA_POS, TMRA_FCONR_NOFIENCB_POS, \
                           TMRA_CCONR_NOFIENCP_POS, TMRA_CCONR_NOFIENCP_POS, TMRA_CCONR_NOFIENCP_POS, \
                           TMRA_CCONR_NOFIENCP_POS};

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u8InputPin &= (uint8_t)TMRA_PIN_ALL;
    while (u8InputPin != 0U)
    {
        if ((u8InputPin & 0x1U) != 0U)
        {
            if (u8PinIdx < TMRA_PIN_PWM_OFFSET)
            {
                u32CCONRAddr = (uint32_t)&TMRAx->FCONR;
            }
            else
            {
                u8TmrCh = u8PinIdx - TMRA_PIN_PWM_OFFSET;
                u32CCONRAddr = (uint32_t)&TMRAx->CCONR1 + (uint32_t)u8TmrCh * 4U;
            }
            BIT_BAND(u32CCONRAddr, au8Offset[u8PinIdx]) = (uint32_t)enNewState;
        }
        u8InputPin >>= 1U;
        u8PinIdx++;
    }
}

/**
 * @brief  Specifies the capture condition for the specified channel.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be a value of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_2:                   Channel 2 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 *   @arg  TMRA_CH_4:                   Channel 4 of TMRA.
 * @param  [in]  u32Cond                The capture condition. Set this parameter to 0xFFFF to select all the conditions of capturing start.
 *                                      This parameter can be values of @ref TMRA_Channel_Capture_Condition
 *   @arg  TMRA_CAPT_COND_INVALID:      The condition of capture is INVALID.
 *   @arg  TMRA_CAPT_COND_PWMR:         The condition of capture is a rising edge is sampled on PWM(pin).
 *   @arg  TMRA_CAPT_COND_PWMF:         The condition of capture is a falling edge is sampled on PWM(pin).
 *   @arg  TMRA_CAPT_COND_EVENT:        The condition of capture is the specified event occurred.
 *   @arg  TMRA_CAPT_COND_TRIGR:        The condition of capture is a rising edge is sampled on TRIG.
 *   @arg  TMRA_CAPT_COND_TRIGF:        The condition of capture is a falling edge is sampled on TRIG.
 * @retval None
 */
void TMRA_SetCaptCond(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32Cond)
{
    uint32_t u32CCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CH(u8TmrCh));

