RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmra.c
    u32CCONRAddr = (uint32_t)&TMRAx->CCONR1 + (uint32_t)u8TmrCh * 4U;
    MODIFY_REG32(RW_MEM32(u32CCONRAddr), TMRA_CAPT_COND_ALL, u32Cond);
}

/**
 * @brief  Specifies the hardware trigger condition of TMRA according to the specified parameters
 *         in the structure stc_tmra_trig_cond_t.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  pstcCond               Pointer to a stc_tmra_trig_cond_t structure value that contains \
 *                                      the configuration information of hardware trigger condition.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCond == NULL.
 */
en_result_t TMRA_SetTrigCond(M4_TMRA_TypeDef *TMRAx, const stc_tmra_trig_cond_t *pstcCond)
{
    uint32_t u32StartCond;
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCond != NULL)
    {
        DDL_ASSERT(IS_TMRA_UNIT(TMRAx));

        u32StartCond = (pstcCond->u32StartCond | pstcCond->u32StopCond | pstcCond->u32ClrCond) & TMRA_TRIG_COND_MSK;
        WRITE_REG32(TMRAx->HCONR, u32StartCond);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set a default value for the hardware trigger condition configuration structure.
 * @param  [in]  pstcCond               Pointer to a stc_tmra_trig_cond_t structure value that contains \
 *                                      the configuration information of hardware trigger condition.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 */
en_result_t TMRA_TrigCondStructInit(stc_tmra_trig_cond_t *pstcCond)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCond != NULL)
    {
        pstcCond->u32StartCond = TMRA_START_COND_INVALID;
        pstcCond->u32StopCond  = TMRA_STOP_COND_INVALID;
        pstcCond->u32ClrCond   = TMRA_CLR_COND_INVALID;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Specifies the event for specified usage.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8EvtUsage             Usage of the event.
 *                                      This parameter can be a value of @ref TMRA_Event_Usage
 *   @arg  TMRA_EVENT_USAGE_CNT:        The specified event is used for counting.
 *   @arg  TMRA_EVENT_USAGE_CAPT:       The specified event is used for capturing.
 * @param  [in]  enEvent                An en_event_src_t enumeration type value.
 * @retval None
 * @note   Correspondence of TMRA instances and the event setting registers is as follows:
 *      TMRA unit         USAGE_CNT        USAGE_CAPT
 * ----------------------------------------------------------
 *      TMRA uint1   |   TMRA_HTSSR0   |   TMRA_HTSSR1
 *      TMRA uint2   |   TMRA_HTSSR1   |   TMRA_HTSSR0
 *      TMRA uint3   |   TMRA_HTSSR2   |   TMRA_HTSSR3
 *      TMRA uint4   |   TMRA_HTSSR3   |   TMRA_HTSSR2
 *      TMRA uint5   |   TMRA_HTSSR0   |   TMRA_HTSSR1
 *      TMRA uint6   |   TMRA_HTSSR1   |   TMRA_HTSSR0
 *      TMRA uint7   |   TMRA_HTSSR2   |   TMRA_HTSSR3
 *      TMRA uint8   |   TMRA_HTSSR3   |   TMRA_HTSSR2
 *      TMRA uint9   |   TMRA_HTSSR0   |   TMRA_HTSSR1
 *      TMRA uint10  |   TMRA_HTSSR1   |   TMRA_HTSSR0
 *      TMRA uint11  |   TMRA_HTSSR2   |   TMRA_HTSSR3
 *      TMRA uint12  |   TMRA_HTSSR3   |   TMRA_HTSSR2
 */
void TMRA_SetTriggerSrc(M4_TMRA_TypeDef *TMRAx, uint8_t u8EvtUsage, en_event_src_t enEvent)
{
    uint32_t u32Idx;
    uint32_t u32HTSSRAddr;
    uint32_t au32CaptEventAddr[] = {TMRA_HTSSR1_ADDR, TMRA_HTSSR0_ADDR, \
                                    TMRA_HTSSR3_ADDR, TMRA_HTSSR2_ADDR};

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_EVT_USAGE(u8EvtUsage));

    u32Idx = TMRA_IDX(TMRAx) % TMRA_CH_COUNT;
    if (u8EvtUsage == TMRA_EVENT_USAGE_CNT)
    {
        u32HTSSRAddr = (uint32_t)&M4_AOS->TMRA_HTSSR0 + u32Idx * 4U;
    }
    else
    {
        u32HTSSRAddr = au32CaptEventAddr[u32Idx];
    }

    MODIFY_REG32(RW_MEM32(u32HTSSRAddr), TMRA_TRIG_EVENT_MSK, enEvent);
}

/**
 * @brief  Enable or disable common trigger event for the specified usage.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8EvtUsage             Usage of the event.
 *                                      This parameter can be a value of @ref TMRA_Event_Usage
 *   @arg  TMRA_EVENT_USAGE_CNT:        The specified event is used for counting.
 *   @arg  TMRA_EVENT_USAGE_CAPT:       The specified event is used for capturing.
 * @param  [in]  u32ComTrig             Common trigger event enable bit mask.
 *                                      This parameter can be values of @ref TMRA_Common_Trigger_Sel
 *   @arg  TMRA_COM_TRIG1:              Common trigger 1.
 *   @arg  TMRA_COM_TRIG2:              Common trigger 2.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg Enable:                       Enable the specified common trigger.
 *   @arg Disable:                      Disable the specified common trigger.
 * @retval None
 */
void TMRA_ComTriggerCmd(M4_TMRA_TypeDef *TMRAx, uint8_t u8EvtUsage, \
                        uint32_t u32ComTrig, en_functional_state_t enNewState)
{
    uint32_t u32Idx;
    uint32_t u32HTSSRAddr;
    uint32_t au32CaptEventAddr[] = {TMRA_HTSSR1_ADDR, TMRA_HTSSR0_ADDR, \
                                    TMRA_HTSSR3_ADDR, TMRA_HTSSR2_ADDR};

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_EVT_USAGE(u8EvtUsage));
    DDL_ASSERT(IS_TMRA_COM_TRIGGER(u32ComTrig));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Idx = TMRA_IDX(TMRAx) % TMRA_CH_COUNT;
    if (u8EvtUsage == TMRA_EVENT_USAGE_CNT)
    {
        u32HTSSRAddr = (uint32_t)&M4_AOS->TMRA_HTSSR0 + u32Idx * 4U;
    }
    else
    {
        u32HTSSRAddr = au32CaptEventAddr[u32Idx];
    }

    if (enNewState == Enable)
    {
        SET_REG32_BIT(RW_MEM32(u32HTSSRAddr), u32ComTrig);
    }
    else
    {
        CLEAR_REG32_BIT(RW_MEM32(u32HTSSRAddr), u32ComTrig);
    }
}

/**
 * @brief  Configures cache function. Specifies the cache condition of compare value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be one of the following values of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 * @param  [in]  u32CacheCond           Cache condition of the specified TMRA unit.
 *                                      This parameter can be a value of @ref TMRA_Cmp_Value_Cache_Condition
 *   @arg  TIEMRA_CACHE_POS_OVF_CLR:    This configuration value applies to non-triangular wave counting mode. \
 *                                      When counting overflow or underflow or counting register was cleared, \
 *                                      transfer CMPARm(m=2,4) to CMPARn(n=1,3).
 *   @arg  TMRA_CACHE_POS_TW_PEAK:      In triangle wave count mode, when count reached peak, \
 *                                      transfer CMMARm(m=2,4) to CMMARn(n=1,3).
 *   @arg  TMRA_CACHE_POS_TW_VALLEY:    In triangle wave count mode, when count reached valley, \
 *                                      transfer CMMARm(m=2,4) to CMMARn(n=1,3).
 * @retval None
 */
void TMRA_CmpValCacheConfig(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32CacheCond)
{
    uint32_t u32BCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT((u8TmrCh == TMRA_CH_1) || (u8TmrCh == TMRA_CH_3));
    DDL_ASSERT(IS_TMRA_CACHE_COND(u32CacheCond));

    u32BCONRAddr = (uint32_t)&TMRAx->BCONR1 + (uint32_t)u8TmrCh * 4U;
    MODIFY_REG32(RW_MEM32(u32BCONRAddr), TMRA_CACHE_COND_MSK, u32CacheCond);
}

/**
 * @brief  Enable or disable the compare value function..
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be one of the following values of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable the comparison reference value function.
 *   @arg  Disable:                     Disable the comparison reference value function.
 * @retval None
 */
void TMRA_CmpValCacheCmd(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, en_functional_state_t enNewState)
{
    uint32_t u32BCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT((u8TmrCh == TMRA_CH_1) || (u8TmrCh == TMRA_CH_3));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32BCONRAddr = (uint32_t)&TMRAx->BCONR1 + (uint32_t)u8TmrCh * 4U;
    BIT_BAND(u32BCONRAddr, TMRA_BCONR_BEN_POS) = (uint32_t)enNewState;
}

/**
 * @brief  Specifies the operation when counting overflow/underflow.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32OvfOp               The operation when count overflow/underflow.
 *   @arg  TMRA_OVF_CNT_CONTINUE:       When counting overflow(or underflow), counting continue.
 *   @arg  TMRA_OVF_CNT_STOP:           When count overflow(or underflow), counting stop.
 * @retval None
 */
void TMRA_SetOvfOperation(M4_TMRA_TypeDef *TMRAx, uint32_t u32OvfOp)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_OVF_OPERATION(u32OvfOp));
    MODIFY_REG32(TMRAx->BCSTR, TMRA_BCSTR_OVSTP, u32OvfOp);
}

/**
 * @brief  Enable or disable synchronous-start. When an even unit enables synchronous-start function, \
 *         start the symmetric odd unit can start the even unit at the same time.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_2:                   TMRA unit 2 instance register base.
 *   @arg  M4_TMRA_4:                   TMRA unit 4 instance register base.
 *   @arg  M4_TMRA_6:                   TMRA unit 6 instance register base.
 *   @arg  M4_TMRA_8:                   TMRA unit 8 instance register base.
 *   @arg  M4_TMRA_10:                  TMRA unit 10 instance register base.
 *   @arg  M4_TMRA_12:                  TMRA unit 12 instance register base.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable the synchronous start.
 *   @arg  Disable:                     Disable the synchronous start.
 * @retval None
 * @note   Only even units can be enabled/disabled synchronous-start function.
 * @note   Symmetric units: uint 1 and 2; uint 3 and 4; ...; uint 11 and 12.
 */
void TMRA_SyncStartCmd(M4_TMRA_TypeDef *TMRAx, en_functional_state_t enNewState)
{
    uint32_t u32Addr;

