RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmra.c
    DDL_ASSERT(IS_TMRA_EVEN_UNIT(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Addr = (uint32_t)&TMRAx->BCSTR;
    BIT_BAND(u32Addr, TMRA_BCSTR_SYNST_POS) = (uint32_t)enNewState;
}

/**
 * @brief  Enable of disable the specified interrupts of the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32IntType             The interrupt type of TMRA. Set this parameter to 0xFFFFFFFF to select all interrupts.
 *                                      This parameter can be values of @ref TMRA_Interrupt_Type
 *   @arg  TMRA_INT_OVF:                Count overflow interrupt.
 *   @arg  TMRA_INT_UNF:                Count underflow interrupt.
 *   @arg  TMRA_INT_CMP_CH1:            Compare-match interrupt of channel 1.
 *   @arg  TMRA_INT_CMP_CH2:            Compare-match interrupt of channel 2.
 *   @arg  TMRA_INT_CMP_CH3:            Compare-match interrupt of channel 3.
 *   @arg  TMRA_INT_CMP_CH4:            Compare-match interrupt of channel 4.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable the specified interrupts.
 *   @arg  Disable:                     Disable the specified interrupts.
 * @retval None
 */
void TMRA_IntCmd(M4_TMRA_TypeDef *TMRAx, uint32_t u32IntType, en_functional_state_t enNewState)
{
    uint32_t u32BCSTR;
    uint32_t u32ICONR;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32IntType &= TMRA_INT_ALL;
    u32BCSTR    = u32IntType & TMRA_BCSTR_INT_MSK;
    u32ICONR    = u32IntType >> 16U;
    if (enNewState == Enable)
    {
        SET_REG32_BIT(TMRAx->BCSTR, u32BCSTR);
        SET_REG32_BIT(TMRAx->ICONR, u32ICONR);
    }
    else
    {
        CLEAR_REG32_BIT(TMRAx->BCSTR, u32BCSTR);
        CLEAR_REG32_BIT(TMRAx->ICONR, u32ICONR);
    }
}

/**
 * @brief  Enable of disable the specified event of the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32EvtType             The event type of TMRA. Set this parameter to 0xFFFF to select all events.
 *                                      This parameter can be values of @ref TMRA_Event_Type
 *   @arg  TMRA_EVENT_CMP_CH1:          Compare-match event of channel 1.
 *   @arg  TMRA_EVENT_CMP_CH2:          Compare-match event of channel 2.
 *   @arg  TMRA_EVENT_CMP_CH3:          Compare-match event of channel 3.
 *   @arg  TMRA_EVENT_CMP_CH4:          Compare-match event of channel 4.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable the specified event.
 *   @arg  Disable:                     Disable the specified event.
 * @retval None
 */
void TMRA_EventCmd(M4_TMRA_TypeDef *TMRAx, uint32_t u32EvtType, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32EvtType &= TMRA_EVENT_ALL;
    if (enNewState == Enable)
    {
        SET_REG32_BIT(TMRAx->ECONR, u32EvtType);
    }
    else
    {
        CLEAR_REG32_BIT(TMRAx->ECONR, u32EvtType);
    }
}

/**
 * @brief  Get the specified flag's status.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32Flag                The status flags of TMRA.
 *                                      This parameter can be values of @ref TMRA_Status_Flag
 *   @arg  TMRA_FLAG_OVF:               Count overflow flag.
 *   @arg  TMRA_FLAG_UNF:               Count underflow flag.
 *   @arg  TMRA_FLAG_CMP_CH1:           Compare-match flag of channel 1.
 *   @arg  TMRA_FLAG_CMP_CH2:           Compare-match flag of channel 2.
 *   @arg  TMRA_FLAG_CMP_CH3:           Compare-match flag of channel 3.
 *   @arg  TMRA_FLAG_CMP_CH4:           Compare-match flag of channel 4.
 * @retval An en_flag_status_t enumeration type value.
 *   @arg Set:                          At least one of the specified flags is set.
 *   @arg Reset:                        None of the specified flags is set.
 */
en_flag_status_t TMRA_GetStatus(const M4_TMRA_TypeDef *TMRAx, uint32_t u32Flag)
{
    uint32_t u32BCSTR;
    uint32_t u32STFLR;
    en_flag_status_t enFlag = Reset;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));

    u32Flag &= TMRA_FLAG_ALL;
    u32BCSTR = READ_REG32_BIT(TMRAx->BCSTR, (u32Flag & TMRA_BCSTR_FLAG_MSK));
    u32STFLR = READ_REG32_BIT(TMRAx->STFLR, (u32Flag >> 16U));

    if ((u32BCSTR != 0U) || (u32STFLR != 0U))
    {
        enFlag = Set;
    }

    return enFlag;
}

/**
 * @brief  Clear the specified flags' status.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32Flag                The status flags of TMRA. Set this parameter to 0xFFFFFFFF to select all status flags.
 *                                      This parameter can be values of @ref TMRA_Status_Flag
 *   @arg  TMRA_FLAG_OVF:               Count overflow flag.
 *   @arg  TMRA_FLAG_UNF:               Count underflow flag.
 *   @arg  TMRA_FLAG_CMP_CH1:           Count match flag of channel 1.
 *   @arg  TMRA_FLAG_CMP_CH2:           Count match flag of channel 2.
 *   @arg  TMRA_FLAG_CMP_CH3:           Count match flag of channel 3.
 *   @arg  TMRA_FLAG_CMP_CH4:           Count match flag of channel 4.
 * @retval None
 */
void TMRA_ClrStatus(M4_TMRA_TypeDef *TMRAx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));

    u32Flag &= TMRA_FLAG_ALL;
    TMRAx->BCSTR &= (uint32_t)(~(u32Flag & TMRA_BCSTR_FLAG_MSK));
    TMRAx->STFLR &= (uint32_t)(~(u32Flag >> 16U));
}

/**
 * @brief  Start the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @retval None
 */
void TMRA_Start(M4_TMRA_TypeDef *TMRAx)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    SET_REG32_BIT(TMRAx->BCSTR, TMRA_BCSTR_START);
}

/**
 * @brief  Stop the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @retval None
 */
void TMRA_Stop(M4_TMRA_TypeDef *TMRAx)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    CLEAR_REG32_BIT(TMRAx->BCSTR, TMRA_BCSTR_START);
}

/**
 * @brief  Specifies the counting direction for the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32CntDir              Count direction.
 *                                      This parameter can be a value of @ref TMRA_Count_Direction
 *   @arg  TMRA_DIR_DOWN:               TMRA count down.
 *   @arg  TMRA_DIR_UP:                 TMRA count up.
 * @retval None
 */
void TMRA_SetCntDir(M4_TMRA_TypeDef *TMRAx, uint32_t u32CntDir)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CNT_DIR(u32CntDir));
    MODIFY_REG32(TMRAx->BCSTR, TMRA_BCSTR_DIR, u32CntDir);
}

/**
 * @brief  Specifies the counting mode for the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32CntMode             Count mode.
 *                                      This parameter can be a value of @ref TMRA_Count_Mode
 *   @arg  TMRA_MODE_SAWTOOTH:          Count mode is sawtooth wave.
 *   @arg  TMRA_MODE_TRIANGLE:          Count mode is triangle wave.
 * @retval None
 */
void TMRA_SetCntMode(M4_TMRA_TypeDef *TMRAx, uint32_t u32CntMode)
{
    uint32_t u32Addr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CNT_MODE(u32CntMode));

    u32Addr = (uint32_t)&TMRAx->BCSTR;
    BIT_BAND(u32Addr, TMRA_BCSTR_SYNST_POS) = (uint32_t)u32CntMode;
}

/**
 * @brief  Specifies the divider of PCLK when the clock source is PCLK.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32ClkDiv              The clock source division.
 *                                      This parameter can be a value of @ref TMRA_PCLK_Divider
 *   @arg  TMRA_PCLK_DIV1:              The clock source of TMRA is PCLK.
 *   @arg  TMRA_PCLK_DIV2:              The clock source of TMRA is PCLK / 2.
 *   @arg  TMRA_PCLK_DIV4:              The clock source of TMRA is PCLK / 4.
 *   @arg  TMRA_PCLK_DIV8:              The clock source of TMRA is PCLK / 8.
 *   @arg  TMRA_PCLK_DIV16:             The clock source of TMRA is PCLK / 16.
 *   @arg  TMRA_PCLK_DIV32:             The clock source of TMRA is PCLK / 32.
 *   @arg  TMRA_PCLK_DIV64:             The clock source of TMRA is PCLK / 64.
 *   @arg  TMRA_PCLK_DIV128:            The clock source of TMRA is PCLK / 128.
 *   @arg  TMRA_PCLK_DIV256:            The clock source of TMRA is PCLK / 256.
 *   @arg  TMRA_PCLK_DIV512:            The clock source of TMRA is PCLK / 512.
 *   @arg  TMRA_PCLK_DIV1024:           The clock source of TMRA is PCLK / 1024.
 * @retval None
 */
void TMRA_SetPCLKDiv(M4_TMRA_TypeDef *TMRAx, uint32_t u32ClkDiv)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_PCLK_DIV(u32ClkDiv));
    MODIFY_REG32(TMRAx->BCSTR, TMRA_BCSTR_CKDIV, u32ClkDiv);
}

/**
 * @brief  Get the counting direction of the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA1 ~ M4_TMRA12:        TMRA unit 1 ~ 12 instance register base.
 * @retval An uint32_t type value of counting direction.
 *   @arg  TMRA_DIR_DOWN:               TMRA count goes down.
 *   @arg  TMRA_DIR_UP:                 TMRA count goes up.
 */
uint32_t TMRA_GetCntDir(const M4_TMRA_TypeDef *TMRAx)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    return READ_REG32_BIT(TMRAx->BCSTR, TMRA_BCSTR_DIR);
}

/**
 * @brief  Specifies the clock source for the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA1 ~ M4_TMRA12:        TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32ClkSrc              The clock source of TMRA.
 *                                      This parameter can be values of @ref TMRA_Clock_Source
 * @retval None
 */
void TMRA_SetClkSrc(M4_TMRA_TypeDef *TMRAx, uint32_t u32ClkSrc)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    WRITE_REG32(TMRAx->HCUPR, (u32ClkSrc & TMRA_CLK_HW_UP_ALL));
    WRITE_REG32(TMRAx->HCDOR, ((u32ClkSrc & TMRA_CLK_HW_DOWN_ALL) >> 16U));
}

/**
 * @brief  Enable or disable the specified hardware clock source of the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA1 ~ M4_TMRA12:        TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u32HwClkSrc            The hardware clock source of TMRA.
 *                                      This parameter can be values of @ref TMRA_Clock_Source except TMRA_CLK_PCLK
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg Enable:                       Enable the specified hardware clock source.
 *   @arg Disable:                      Disable the specified hardware clock source.
 * @retval None
 */
void TMRA_HwClkSrcCmd(M4_TMRA_TypeDef *TMRAx, uint32_t u32HwClkSrc, en_functional_state_t enNewState)
{
    const uint32_t u32HwCntUpClk   = u32HwClkSrc & TMRA_CLK_HW_UP_ALL;
    const uint32_t u32HwCntDownClk = (u32HwClkSrc & TMRA_CLK_HW_DOWN_ALL) >> 16U;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    if (enNewState == Enable)
    {
        SET_REG32_BIT(TMRAx->HCUPR, u32HwCntUpClk);
        SET_REG32_BIT(TMRAx->HCDOR, u32HwCntDownClk);
    }
    else
    {
        CLEAR_REG32_BIT(TMRAx->HCUPR, u32HwCntUpClk);
        CLEAR_REG32_BIT(TMRAx->HCDOR, u32HwCntDownClk);
    }
}

/**
 * @brief  Specifies the PWM polarity when counting start.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be a value of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_2:                   Channel 2 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 *   @arg  TMRA_CH_4:                   Channel 4 of TMRA.
 * @param  [in]  u32Polarity            Polarity of PWM output.
 *                                      This parameter can be a value of @ref TMRA_PWM_Start_Polarity
 *   @arg  TMRA_PWM_START_LOW:          The polarity of PWM output is low.
 *   @arg  TMRA_PWM_START_HIGH:         The polarity of PWM output is high.
 *   @arg  TMRA_PWM_START_KEEP:         The polarity of PWM output keeps the current polarity.
 * @retval None
 */
void TMRA_PWM_SetStartPolarity(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32Polarity)
{
    uint32_t u32PCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CH(u8TmrCh));
    DDL_ASSERT(IS_TMRA_PWM_START_POLARITY(u32Polarity));

