RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmra.c
    u32PCONRAddr = (uint32_t)&TMRAx->PCONR1 + (uint32_t)u8TmrCh * 4U;
    MODIFY_REG32(RW_MEM32(u32PCONRAddr), TMRA_PCONR_STAC, u32Polarity);
}

/**
 * @brief  Specifies the PWM polarity when counting stop.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be a value of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_2:                   Channel 2 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 *   @arg  TMRA_CH_4:                   Channel 4 of TMRA.
 * @param  [in]  u32Polarity            Polarity of PWM output.
 *                                      This parameter can be a value of @ref TMRA_PWM_Stop_Polarity
 *   @arg  TMRA_PWM_STOP_LOW:           The polarity of PWM output is low.
 *   @arg  TMRA_PWM_STOP_HIGH:          The polarity of PWM output is high.
 *   @arg  TMRA_PWM_STOP_KEEP:          The polarity of PWM output keeps the current polarity.
 * @retval None
 */
void TMRA_PWM_SetStopPolarity(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32Polarity)
{
    uint32_t u32PCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CH(u8TmrCh));
    DDL_ASSERT(IS_TMRA_PWM_STOP_POLARITY(u32Polarity));

    u32PCONRAddr = (uint32_t)&TMRAx->PCONR1 + (uint32_t)u8TmrCh * 4U;
    MODIFY_REG32(RW_MEM32(u32PCONRAddr), TMRA_PCONR_STPC, u32Polarity);
}

/**
 * @brief  Specifies the PWM polarity when counting matches the compare reference value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be a value of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_2:                   Channel 2 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 *   @arg  TMRA_CH_4:                   Channel 4 of TMRA.
 * @param  [in]  u32Polarity            Polarity of PWM output.
 *                                      This parameter can be a value of @ref TMRA_PWM_Match_Cmp_Polarity
 *   @arg  TMRA_PWM_CMP_LOW:            The polarity of PWM output is low.
 *   @arg  TMRA_PWM_CMP_HIGH:           The polarity of PWM output is high.
 *   @arg  TMRA_PWM_CMP_KEEP:           The polarity of PWM output keeps the current polarity.
 *   @arg  TMRA_PWM_CMP_REVERSE:        PWM output reverses the current polarity.
 * @retval None
 */
void TMRA_PWM_SetMatchCmpPolarity(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32Polarity)
{
    uint32_t u32PCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CH(u8TmrCh));
    DDL_ASSERT(IS_TMRA_PWM_CMP_POLARITY(u32Polarity));

    u32PCONRAddr = (uint32_t)&TMRAx->PCONR1 + (uint32_t)u8TmrCh * 4U;
    MODIFY_REG32(RW_MEM32(u32PCONRAddr), TMRA_PCONR_CMPC, u32Polarity);
}

/**
 * @brief  Specifies the PWM polarity when counting matches the period reference value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be a value of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_2:                   Channel 2 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 *   @arg  TMRA_CH_4:                   Channel 4 of TMRA.
 * @param  [in]  u32Polarity            Polarity of PWM output.
 *                                      This parameter can be a value of @ref TMRA_PWM_Match_Period_Polarity
 *   @arg  TMRA_PWM_PERIOD_LOW:         The polarity of PWM output is low.
 *   @arg  TMRA_PWM_PERIOD_HIGH:        The polarity of PWM output is high.
 *   @arg  TMRA_PWM_PERIOD_KEEP:        The polarity of PWM output keeps the current polarity.
 *   @arg  TMRA_PWM_PERIOD_REVERSE:     PWM output reverses the current polarity.
 * @retval None
 */
void TMRA_PWM_SetMatchPeriodPolarity(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32Polarity)
{
    uint32_t u32PCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CH(u8TmrCh));
    DDL_ASSERT(IS_TMRA_PWM_PERIOD_POLARITY(u32Polarity));

    u32PCONRAddr = (uint32_t)&TMRAx->PCONR1 + (uint32_t)u8TmrCh * 4U;
    MODIFY_REG32(RW_MEM32(u32PCONRAddr), TMRA_PCONR_PERC, u32Polarity);
}

/**
 * @brief  Specifies the PWM polarity when next cycle start.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be a value of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_2:                   Channel 2 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 *   @arg  TMRA_CH_4:                   Channel 4 of TMRA.
 * @param  [in]  u32Polarity            Polarity of PWM output.
 *                                      This parameter can be a value of @ref TMRA_PWM_Force_Polarity
 *   @arg  TMRA_PWM_FORCE_INVALID:      Force polarity is invalid.
 *   @arg  TMRA_PWM_FORCE_LOW:          Force the PWM output low at the beginning of the next cycle. \
 *                                      The beginning of the next cycle: overflow position or underflow position \
 *                                      of sawtooth wave; valley position of triangle wave.
 *   @arg  TMRA_PWM_FORCE_HIGH:         Force the PWM output high at the beginning of the next cycle. \
 *                                      The beginning of the next cycle: overflow position or underflow position \
 *                                      of sawtooth wave; valley position of triangle wave.
 * @retval None
 */
void TMRA_PWM_SetForcePolarity(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32Polarity)
{
    uint32_t u32PCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CH(u8TmrCh));
    DDL_ASSERT(IS_TMRA_PWM_FORCE_POLARITY(u32Polarity));

