RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmra.c
    u32PCONRAddr = (uint32_t)&TMRAx->PCONR1 + (uint32_t)u8TmrCh * 4U;
    MODIFY_REG32(RW_MEM32(u32PCONRAddr), TMRA_PCONR_FORC, u32Polarity);
}

/**
 * @brief  Specifies the capture condition for the specified channel.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be a value of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_2:                   Channel 2 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 *   @arg  TMRA_CH_4:                   Channel 4 of TMRA.
 * @param  [in]  u32CaptCond            The capture condition. Set this parameter to 0xFFFF to select all the conditions of capturing start.
 *                                      This parameter can be values of @ref TMRA_Channel_Capture_Condition
 *   @arg  TMRA_CAPT_COND_PWMR:         The condition of capture is a rising edge is sampled on PWM(pin).
 *   @arg  TMRA_CAPT_COND_PWMF:         The condition of capture is a falling edge is sampled on PWM(pin).
 *   @arg  TMRA_CAPT_COND_EVENT:        The condition of capture is the specified event occurred.
 *   @arg  TMRA_CAPT_COND_TRIGR:        The condition of capture is a rising edge is sampled on TRIG.
 *   @arg  TMRA_CAPT_COND_TRIGF:        The condition of capture is a falling edge is sampled on TRIG.
 * @param  [in]  enNewState             An @ref en_functional_state_t value.
 *   @arg  Enable:                      Enable the sepcified capture conditions.
 *   @arg  Disable:                     Disable the sepcified capture conditions.
 * @retval None
 */
void TMRA_CaptCondCmd(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32CaptCond, en_functional_state_t enNewState)
{
    uint32_t u32CCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CH(u8TmrCh));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32CaptCond &= TMRA_CAPT_COND_ALL;
    u32CCONRAddr = (uint32_t)&TMRAx->CCONR1 + (uint32_t)u8TmrCh * 4U;
    if (enNewState == Enable)
    {
        SET_REG32_BIT(RW_MEM32(u32CCONRAddr), u32CaptCond);
    }
    else
    {
        CLEAR_REG32_BIT(RW_MEM32(u32CCONRAddr), u32CaptCond);
    }
}

/**
 * @brief  Enable or disable the specified hardware start condition.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMRA_1 ~ M4_TMRA_12:      TMRA unit 1 ~ 12 instance register base.
 * @param  [in]  u8TmrCh                TMRA channel number.
 *                                      This parameter can be a value of @ref TMRA_Channel
 *   @arg  TMRA_CH_1:                   Channel 1 of TMRA.
 *   @arg  TMRA_CH_2:                   Channel 2 of TMRA.
 *   @arg  TMRA_CH_3:                   Channel 3 of TMRA.
 *   @arg  TMRA_CH_4:                   Channel 4 of TMRA.
 * @param  [in]  u32TrigCond            The trigger condition.
 *                                      This parameter can be a value of:
 *                                      @ref TMRA_Hardware_Start_Condition
 *                                      @ref TMRA_Hardware_Stop_Condition
 *                                      @ref TMRA_Hardware_Clear_Condition
 *   @arg  TMRA_START_COND_TRIGR:       1. Sync start is invalid: The condition is that a rising edge is sampled on TRIG of the current TMRA unit. \
 *                                      2. Sync start is valid: The condition is that a rising edge is sampled on TRIG of the symmetric TMRA unit.
 *   @arg  TMRA_START_COND_TRIGF:       1. Sync start is invalid: The condition is that a falling edge is sampled on TRIG of the current TMRA unit. \
 *                                      2. Sync start is valid: The condition is that a falling edge is sampled on TRIG of the symmetric TMRA unit.
 *   @arg  TMRA_START_COND_EVENT:       The condition is that the event which is set in register TMRA_HTSSR0 has occurred.
 *   @arg  TMRA_STOP_COND_TRIGR:        The condition is that a rising edge is sampled on pin TRIG of the current TMRA unit.
 *   @arg  TMRA_STOP_COND_TRIGF:        The condition is that a falling edge is sampled on pin TRIG of the current TMRA unit.
 *   @arg  TMRA_STOP_COND_EVENT:        The condition is that the event which is set in register TMRA_HTSSR0 has occurred.
 *   @arg  TMRA_CLR_COND_TRIGR:         The condition is that a rising edge is sampled on TRIG of the current TMRA unit.
 *   @arg  TMRA_CLR_COND_TRIGF:         The condition is that a falling edge is sampled on TRIG of the current TMRA unit.
 *   @arg  TMRA_CLR_COND_EVENT:         The condition is that the event which is set in register TMRA_HTSSR0 has occurred.
 *   @arg  TMRA_CLR_COND_SYM_TRIGR:     The condition is that a rising edge is sampled on TRIG of the symmetric unit.
 *   @arg  TMRA_CLR_COND_SYM_TRIGF:     The condition is that a falling edge is sampled on TRIG of the symmetric unit.
 *   @arg  TMRA_CLR_COND_PWM3R:         The condition is that a rising edge is sampled on PWM3 of the current TMRA unit.
 *   @arg  TMRA_CLR_COND_PWM3F:         The condition is that a falling edge is sampled on PWM3 of the current TMRA unit.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable the specified hardware start condition.
 *   @arg  Disable:                     Disable the specified hardware start condition.
 * @retval None
 */
void TMRA_TrigCondCmd(M4_TMRA_TypeDef *TMRAx, uint8_t u8TmrCh, uint32_t u32TrigCond, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32TrigCond &= TMRA_TRIG_COND_MSK;
    if (enNewState == Enable)
    {
        SET_REG32_BIT(TMRAx->HCONR, u32TrigCond);
    }
    else
    {
        CLEAR_REG32_BIT(TMRAx->HCONR, u32TrigCond);
    }
}

/**
 * @}
 */

#endif /* DDL_TMRA_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
